tutorials/rheoEFoam/ICEO/DebyeHuckel/0/phiE
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  9                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      phiE;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 2 -3 0 0 -1 0];

internalField   uniform 0;

boundaryField
{
    elecNorth
    {
	type            fixedValue;
	value           uniform 0.012926;      
    }
   
    elecSouth
    {
	type            fixedValue;
	value           uniform -0.012926;        
    }
    
    cylinder
    {
	type            zeroGradient;
    }

    "wall.*"
    {
	type            zeroGradient;    
    }

    frontAndBack
    {
	type            empty;     
    }
}

// ************************************************************************* //
